 //Вывести заданное количество случайных чисел с переходом и без перехода на новую строку.

public class Random {
    public static void main(String[] args) {

        int[] x = {1, 2, 3, 4, 5};
        for (int i : x) ;
        System.out.println(i);
        System.out.print(i);
    }
}
